-- Вставка данных в таблицу Users
INSERT INTO Users (username,password,name, telephone) VALUES ('makosiale',
                                                              '$2a$12$Qwulrz4hPKoIfZQpHOsxZuaLUVshIxXdlraJJFUH5vw2tb1PwmkI6',
                                                              'Максим',
                                                              '+79123456789'),
                                                             ('maksim',
                                                              '$2a$12$Qwulrz4hPKoIfZQpHOsxZuaLUVshIxXdlraJJFUH5vw2tb1PwmkI6',
                                                              'Максим',
                                                              '+73234343434');
INSERT INTO Roles(name) VALUES ('ADMIN'),('USER');
INSERT INTO Usersroles(user_id,role_id) VALUES (1,1),(2,2);

-- Вставка данных в таблицу Employees
INSERT INTO Employees (name, surname, patronymic, position, phone_number)
VALUES ('Максим', 'Петров', 'Иванович', 'Повар', '+79231234567'),
       ('Ольга', 'Сидорова', 'Александровна', 'Повар', '+79101112222'),
       ('Иван', 'Кузнецов', 'Петрович', 'Повар', '+79012345678'),
       ('Екатерина', 'Смирнова', 'Владимировна', 'Повар', '+79999999999');

-- Вставка данных в таблицу Burgers
INSERT INTO Burgers (name, cost)
VALUES ('Чизбургер', 250.00),
       ('Гамбургер', 200.00),
       ('Филе-О-Фиш', 300.00),
       ('Цезарь', 350.00),
       ('Двойной Чизбургер', 400.00),
       ('Биг Мак', 320.00);

-- Вставка данных в таблицу Ingredients
INSERT INTO Ingredients (name, residue)
VALUES ('Говяжий фарш', 100),
       ('Сыр Чеддер', 50),
       ('Рыба палтус', 20),
       ('Салат', 70),
       ('Помидор', 30),
       ('Лук', 100),
       ('Соус тартар', 150),
       ('Булочка для бургера', 200);

-- Вставка данных в таблицу Recepts
INSERT INTO Recepts (burger_id, ingredient_id, quantity)
VALUES (1, 1, 2),
       (1, 2, 1),
       (1, 8, 1),
       (2, 1, 1),
       (2, 3, 1),
       (2, 8, 1),
       (3, 2, 2),
       (3, 8, 1),
       (4, 4, 1),
       (4, 5, 2),
       (4, 6, 1),
       (4, 8, 1),
       (5, 1, 4),
       (5, 2, 2),
       (5, 8, 1),
       (6, 4, 2),
       (6, 7, 1),
       (6, 8, 1);
/*
-- Вставка данных в таблицу Orders
INSERT INTO Orders (datetime, adress, employee_id, user_id)
VALUES
    ('2024-12-01 10:30:00', 'ул. Ленина, 10', 1, 1),
    ('2024-12-01 11:00:00', 'ул. Советская, 20', 2, 2),
    ('2024-12-01 12:15:00', 'ул. Гагарина, 5', 3, 1),
    ('2024-12-01 13:45:00', 'ул. Победы, 25', 4, 2),
    ('2024-12-01 14:30:00', 'ул. Центральная, 15', 1, 1);

-- Вставка данных в таблицу OrdersList
INSERT INTO OrdersList (order_id, burger_id, count)
VALUES
    (1, 1, 2), -- Заказ №1: 2 Чизбургера
    (1, 3, 1), -- Заказ №1: 1 Филе-О-Фиш
    (2, 2, 3), -- Заказ №2: 3 Гамбургера
    (2, 4, 2), -- Заказ №2: 2 Цезаря
    (3, 5, 1), -- Заказ №3: 1 Двойной Чизбургер
    (3, 6, 1), -- Заказ №3: 1 Биг Мак
    (4, 3, 2), -- Заказ №4: 2 Филе-О-Фиш
    (4, 2, 1), -- Заказ №4: 1 Гамбургер
    (5, 4, 1), -- Заказ №5: 1 Цезарь
    (5, 1, 3); -- Заказ №5: 3 Чизбургера
*/